---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FabricationNetworkChangeService..::..ChangeService Method
FabricationNetworkChangeService Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ChangeService(ISet<(Of <<'(ElementId>)>>), Int32, Int32) | Changes the service of the selection of fabrication parts. |
|  | ChangeService(ISet<(Of <<'(ElementId>)>>), Int32, Int32, Boolean) | Changes the service of the selection of fabrication parts. |

# See Also

FabricationNetworkChangeService Class

FabricationNetworkChangeService Members

Autodesk.Revit.DB.Fabrication Namespace